<?php

namespace Database\Seeders;

use App\Models\Route;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class RoutesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Route::create([
            'name'=>'مسار التدريب',
            'description'=>'
            يهدف هذا المسار الي تجميع معلومات عن الفرص التدريبية المجانية و عرض فرص تدريب للمتدربين في مجال حلول تقنية المعلومات بالاضافة الى شرح مناهج وتدريب من قبل خريجين سابقين 
          '
        ]);
        Route::create([
            'name'=>'مسار التعليم',
            'description'=>'
            يهدف هذا المسار الى تجميع معلومات عن اكمال الدراسات العليا داخل المملكة او خارجها مع اضافة شروحات عن شروط ومتطلبات التقدم للحصول عىل قبولات جامعية مع توضيح اهم النقاط لاللتحاق ببرامج البعثات بالاضافة الى توفير الدعم لمن يرغب بالدراسة بالخارج بتوفير قبوالت جامعية مجانية.
            '
        ]);
        Route::create([
            'name'=>'مسار التوظيف',
            'description'=>'
            يهدف هذا المسار الى تجميع معلومات عن افضل الشركات التقنية ومعلومات عن اليه التقديم عليها بالاضافة الى الفرص الوظيفية المتاحة لتيسير الحصول علي فرص العمل للشباب الخريجين وتبسيط الامر
            '
        ]);
    }
}
